[ {
  "symbol" : "AMGN",
  "publishedDate" : "2022-12-06 10:17:27",
  "title" : "Mirati Therapeutics Crashes As The Cancer Rivalry With Amgen Heats Up",
  "image" : "https://cdn.snapi.dev/images/v1/c/q/biotech31-1664451.jpg",
  "site" : "Investors Business Daily",
  "text" : "Mirati said almost half of patients responded to its lung cancer regimen, but MRTX stock crashed on questions about its market opportunity. The post Mirati Therapeutics Crashes As The Cancer Rivalry With Amgen Heats Up appeared first on Investor's Business Daily.",
  "url" : "https://www.investors.com/news/technology/mrtx-stock-crashes-as-amgen-rivalry-heats-up-with-new-lung-cancer-data/"
}, {
  "symbol" : "AMGN",
  "publishedDate" : "2022-12-05 12:55:02",
  "title" : "Amgen Inc. (AMGN) World Congress on Insulin Resistance, Diabetes and Cardiovascular Disease Conference (Transcript)",
  "image" : "https://cdn.snapi.dev/images/v1/i/q/transcript3-1662929.jpg",
  "site" : "Seeking Alpha",
  "text" : "Amgen Inc. (NASDAQ:AMGN ) World Congress on Insulin Resistance, Diabetes and Cardiovascular Disease Conference Call December 5, 2022 8:00 AM ET Company Participants David Reese - Executive Vice President, Research and Development Narimon Honarpour - Vice President, Clinical Development Conference Call Participants Umer Raffat - Evercore Matthew Harrison - Morgan Stanley Michael Yee - Jefferies Jay Olson - Oppenheimer Salveen Richter - Goldman Sachs Evan Seigerman - BMO Capital Geoff Meacham - Bank of America Colin Bristow - UBS Mohit Bansal - Wells Fargo Michael Schmidt - Guggenheim Partners David Risinger - SVB Securities Chris Schott - JPMorgan Chase Matt Phipps - William Blair Trung Huynh - Credit Suisse Colin Bristow - UBS Operator Hello and welcome. My name is Alex and I will be your conference facilitator today for the Amgen Analyst and Investor Conference Call from the World Congress on Insulin Resistance, Diabetes and Cardiovascular Disease Conference.",
  "url" : "https://seekingalpha.com/article/4562417-amgen-inc-amgn-world-congress-on-insulin-resistance-diabetes-and-cardiovascular-disease"
}, {
  "symbol" : "AMGN",
  "publishedDate" : "2022-12-05 09:43:37",
  "title" : "Horizon Topples After J&J Pulls Out Of Bidding War, Leaving Amgen, Sanofi",
  "image" : "https://cdn.snapi.dev/images/v1/r/a/biotech8-1662521.jpg",
  "site" : "Investors Business Daily",
  "text" : "Johnson & Johnson dropped out of the bidding process for Horizon Therapeutics, pushing HZNP stock into the red on Monday. The post Horizon Topples After J&J Pulls Out Of Bidding War, Leaving Amgen, Sanofi appeared first on Investor's Business Daily.",
  "url" : "https://www.investors.com/news/technology/hznp-stock-topples-after-jj-pulls-out-of-bidding-war/"
}, {
  "symbol" : "AMGN",
  "publishedDate" : "2022-12-05 06:30:25",
  "title" : "7 Christmas Stocks to Buy for Happy Holidays",
  "image" : "https://cdn.snapi.dev/images/v1/l/1/stocks-to-buy-greedy1600-1024x576-1662026.png",
  "site" : "InvestorPlace",
  "text" : "It makes sense if you haven't been thinking much about Christmas stocks. You really can't be blamed for not being in the Christmas spirit this year.",
  "url" : "https://investorplace.com/2022/12/7-christmas-stocks-to-buy-now-for-happy-holidays/"
}, {
  "symbol" : "AMGN",
  "publishedDate" : "2022-12-04 12:00:04",
  "title" : "Dow Stocks To Trade In December",
  "image" : "https://cdn.snapi.dev/images/v1/e/u/dow-stocks-to-trade-in-december-1661787.jpg",
  "site" : "Forbes",
  "text" : "December is likely to bring higher prices. Here are long and short recommendations.",
  "url" : "https://www.forbes.com/sites/greatspeculations/2022/12/04/dow-stocks-to-trade-in-december/"
} ]

